InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефоновБуквенные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефоновБуквенные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опКодыГородов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опКодыГородов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритетный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UTC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДиапазона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДиапазона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_стНастройкиТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_стНастройкиТелефонии</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>500</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МИКО_стУчетныеЗаписиАТС</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>did</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>accountcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonModules/МИКО_опЗаписьКИ/Ext/Module.bsl
// #Область СлужебныеПроцедурыИФункции

// Наполнение телефонной книги регистров "МИКО_опИндексНомераТелефонов" и "МИКО_опИндексНомераТелефоновБуквенные".
// 
Процедура СправочникСКонтактамиПриЗаписи(Источник, Отказ) Экспорт
	
Если Отказ Тогда Возврат; КонецЕсли; 
	// 1. Определим тип номера 
	Буквенные = Новый Соответствие;
	Числовые  = Новый Соответствие;

    ДополнитьИндексыНомеров_ТЧ_КИ(Числовые, Буквенные, Источник);
	ДополнитьИндексыНомеров_РС_КИ(Числовые, Буквенные, Источник);
	ЗполнитьИндексыНомеров(Числовые, Буквенные, Источник);
	
КонецПроцедуры

Процедура РегСведенийКИПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда Возврат; КонецЕсли; 
	// 1. Определим тип номера 
	Буквенные = Новый Соответствие;
	Числовые  = Новый Соответствие;
	
	ОбъектКИ = Источник.Отбор.Объект.Значение;
	
    ДополнитьИндексыНомеров_ТЧ_КИ(Числовые, Буквенные, ОбъектКИ);
	ДополнитьИндексыНомеров_РС_КИ(Числовые, Буквенные, ОбъектКИ);
	ЗполнитьИндексыНомеров(Числовые, Буквенные, ОбъектКИ); 

КонецПроцедуры

Процедура ДополнитьИндексыНомеров_ТЧ_КИ(Числовые, Буквенные, Источник) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник) Тогда 
		Возврат; 
	КонецЕсли; 

	Если Источник.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда 
		Возврат; 
	КонецЕсли;		
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
	Для каждого Контакт Из Источник.КонтактнаяИнформация Цикл
		Если Контакт.Тип <> Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;	
		КонецЕсли;
		
		РедактируемаяИнформация = КонтактнаяИнформацияИзXML(Контакт.ЗначенияПолей, Контакт.Представление);
		Если РедактируемаяИнформация = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Представление = РедактируемаяИнформация.Представление;
		Телефон 	  = РедактируемаяИнформация.Состав;
		НомерТелефона = "" + Телефон.КодСтраны + Телефон.КодГорода + Телефон.Номер;
		// Наполним массивы номеров для обновления информации в истории звонков.
		Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
			НомерТелефона = УбратьИзНомераТелефонаВсеПрефиксы(Представление, """' /*+=\,!;%:?()");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
			Продолжить;
		КонецЕсли; 

		Если ЭтоЧисловойНомер(НомерТелефона) Тогда
			НомерТелефона 		= Прав(УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона), КоличествоХранимыхЦифрТелефона);
			НомерТелефонаЧислом = ПреобразоватьНомерДляСохранения(НомерТелефона, 		 КоличествоХранимыхЦифрТелефона);
			
			Если ЗначениеЗаполнено(НомерТелефона) Тогда
				Числовые.Вставить(НомерТелефонаЧислом, НомерТелефона);
			КонецЕсли; 
		ИначеЕсли ВСловеТолькоЛатиница(НомерТелефона) Тогда
			// Это "Скайп".
			Буквенные.Вставить(НомерТелефона);
		Иначе
			Продолжить;
		КонецЕсли; 	

	КонецЦикла; // Обход контактной информации.

КонецПроцедуры
Процедура ДополнитьИндексыНомеров_РС_КИ(Числовые, Буквенные, Источник) Экспорт

	Если Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") = Неопределено Тогда
		Возврат;	
	КонецЕсли; 

	врКонтактнаяИнформация = Вычислить("РегистрыСведений.КонтактнаяИнформация");
	Попытка
		НаборЗаписей = врКонтактнаяИнформация.СоздатьНаборЗаписей();
	Исключение
		Возврат;
	КонецПопытки; 
	КоличествоХранимыхЦифрТелефона = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
	НаборЗаписей.Отбор.Объект.Установить(Источник);
	НаборЗаписей.Прочитать();
	
	ОбъектКИ = Источник;
	
	Для каждого ЗаписьКонтакт Из НаборЗаписей Цикл
		
		Если ЗаписьКонтакт.Тип <> Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;	
		КонецЕсли;
		
		ПредставлениеНомера = ЗаписьКонтакт.Поле1 + ЗаписьКонтакт.Поле2 + ЗаписьКонтакт.Поле3;
		ПредставлениеБаза   = ЗаписьКонтакт.Представление;

		Если ЗначениеЗаполнено(ЗаписьКонтакт.Поле4) 
			 И НЕ ЗначениеЗаполнено(ПредставлениеНомера)
			 И ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда
			// Это внутренний номер телефона. Такие номера могут быть только у пользователей. 
			НомерТелефона = ЗаписьКонтакт.Поле4;
		ИначеЕсли НЕ ЗначениеЗаполнено(ПредставлениеНомера + ЗаписьКонтакт.Поле4) И ЗначениеЗаполнено(ПредставлениеБаза) Тогда	
			НомерТелефона = ПредставлениеБаза;
		Иначе
			НомерТелефона = ПредставлениеНомера;
		КонецЕсли;
		
		// Наполним массивы номеров для обновления информации в истории звонков.
		Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
			НомерТелефона = УбратьИзНомераТелефонаВсеПрефиксы(ЗаписьКонтакт.Представление, """' /*+=\,!;%:?()");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
			Продолжить;
		КонецЕсли; 

		Если ЭтоЧисловойНомер(НомерТелефона) Тогда
			НомерТелефона 		= Прав(УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона), КоличествоХранимыхЦифрТелефона);
			НомерТелефонаЧислом = ПреобразоватьНомерДляСохранения(НомерТелефона, 		 КоличествоХранимыхЦифрТелефона);
			Если ЗначениеЗаполнено(НомерТелефона) Тогда
				Числовые.Вставить(НомерТелефонаЧислом, НомерТелефона);
			КонецЕсли; 
		ИначеЕсли ВСловеТолькоЛатиница(НомерТелефона) И ЗначениеЗаполнено(НомерТелефона) Тогда
			Буквенные.Вставить(НомерТелефона);		
		Иначе
			Продолжить;
		КонецЕсли; 	

	КонецЦикла; // Обход контактной информации


КонецПроцедуры

// По переданным массивам номеров числовых и буквенных выполняет запись
// в регистры сведений "МИКО_опИндексНомераТелефоновБуквенные" и "МИКО_опИндексНомераТелефонов".
// 
Процедура ЗполнитьИндексыНомеров(Числовые, Буквенные, ОбъектКИ) Экспорт

	НаборЗаписей = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);

	НаборЗаписейБуквенные = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьНаборЗаписей();
	НаборЗаписейБуквенные.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);
		
	Если Числовые.Количество()>0 Тогда
		Для каждого текНомер Из Числовые Цикл
		 	новЗапись = НаборЗаписей.Добавить();
			новЗапись.НомерТелефонаИндекс = текНомер.Ключ;
		    новЗапись.СсылкаНаКлиента 	  = ОбъектКИ;
		    новЗапись.НомерТелефонаСтрокой= текНомер.Значение;
		КонецЦикла; 
	КонецЕсли; 
	
	Если Буквенные.Количество()>0 Тогда
		Для каждого текНомер Из Буквенные Цикл
		 	новЗапись = НаборЗаписейБуквенные.Добавить();
			новЗапись.НомерТелефонаИндекс 	= СтрЗаменить(текНомер.Ключ," ","");
		    новЗапись.СсылкаНаКлиента 		= ОбъектКИ;
		    новЗапись.НомерТелефонаСтрокой 	= СтрЗаменить(текНомер.Ключ," ","");
		КонецЦикла; 
	КонецЕсли; 
	
	Попытка
	НаборЗаписей.Записать();                                   
	Исключение
	КонецПопытки; 
	
	Попытка
	НаборЗаписейБуквенные.Записать();                                   
	Исключение
	КонецПопытки;

КонецПроцедуры // ЗполнитьИндексыНомеров()

// Поиск клиента.
// 
Функция НайтиКлиентаПоНомеруТелефона(Знач Параметр, Знач ПараметрыКонфигурации = Неопределено) Экспорт

	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Возврат НайтиКлиентаПоНомеру(Параметр, ПараметрыКонфигурации);	
	ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") Тогда
		Результат = Новый Массив;
		
		Для каждого ТекНомер Из Параметр Цикл
		 	врРез = НайтиКлиентаПоНомеру(ТекНомер, ПараметрыКонфигурации);
			Если НЕ врРез=Неопределено Тогда
				Результат.Добавить(врРез);	
			КонецЕсли; 
		КонецЦикла; 
		
		Возврат Результат;
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции // НайтиКлиентаПоНомеруТелефона()

// Возвращает владльцев номера телефона.
// 
Функция КомуПринадлежитНомер(Знач Параметр) Экспорт
	Результат = Новый Массив;

	Если НЕ ТипЗнч(Параметр)=Тип("Строка") Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	// Классическое представление номера 74952293042.
	Если ЭтоЧисловойНомер(Параметр) Тогда
		ЧислоЦифрДляХранения = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
		НомерТелефонаИндекс = ПреобразоватьНомерДляСохранения(Параметр, ЧислоЦифрДляХранения);
		ИмяРегистра = "МИКО_опИндексНомераТелефонов";		
	// Скайп номер телефона: пример miko_team.	
	ИначеЕсли ВСловеТолькоЛатиница(Параметр) Тогда
		НомерТелефонаИндекс = Параметр;
		ИмяРегистра = "МИКО_опИндексНомераТелефоновБуквенные";		
	Иначе
		Возврат Неопределено;                           
	КонецЕсли;
	   
	Запрос = Новый Запрос;
	
	//Доработки для последних релизов УНФ - НАЧАЛО
	Попытка
		ИзмененаПодчиненность = МИКО_стОбщегоНазначенияСерверПовторный.ИзмененаСтруктураПодчиненностиКонтактовУНФ();
		Если ИзмененаПодчиненность Тогда
			Запрос.Текст = МИКО_стОбщегоНазначенияСерверПовторный.ПолучитьЗапросКИДляУНФ("1", ИмяРегистра);
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Пока РезультатЗапроса.Следующий() Цикл
				врРезультат = Новый Структура("Партнер,Абонент,НомерТелефона");
				ЗаполнитьЗначенияСвойств(врРезультат, РезультатЗапроса);
				Результат.Добавить(врРезультат);
			КонецЦикла; 
			Возврат Результат;
		КонецЕсли; 
	Исключение
		ИзмененаПодчиненность = Ложь;
	КонецПопытки; 
	//Доработки для последних релизов УНФ - КОНЕЦ
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_опИндексНомераТелефонов.СсылкаНаКлиента,
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК МИКО_опИндексНомераТелефонов    
		|ГДЕ
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс = &НомерТелефонаЧислом";
	Запрос.УстановитьПараметр("НомерТелефонаЧислом", НомерТелефонаИндекс);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		врДанные = Новый Структура("Владелец,ОбъектВладелец");
		ЗаполнитьЗначенияСвойств(врДанные, РезультатЗапроса.СсылкаНаКлиента);
	    Если ЗначениеЗаполнено(врДанные.Владелец) Тогда
			врРезультат = Новый Структура("Партнер,Абонент,НомерТелефона",врДанные.Владелец, РезультатЗапроса.СсылкаНаКлиента, РезультатЗапроса.НомерТелефонаСтрокой);
		ИначеЕсли ЗначениеЗаполнено(врДанные.ОбъектВладелец) Тогда 	
			врРезультат = Новый Структура("Партнер,Абонент,НомерТелефона",врДанные.ОбъектВладелец, РезультатЗапроса.СсылкаНаКлиента, РезультатЗапроса.НомерТелефонаСтрокой);
		Иначе
			врРезультат = Новый Структура("Партнер,Абонент,НомерТелефона",РезультатЗапроса.СсылкаНаКлиента, Неопределено, РезультатЗапроса.НомерТелефонаСтрокой);
		КонецЕсли;
		Результат.Добавить(врРезультат);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции // НайтиКлиентаПоНомеру()

Функция НайтиКлиентаПоНомеру(Знач Параметр, Знач ПараметрыКонфигурации = Неопределено)
	Если НЕ ТипЗнч(Параметр)=Тип("Строка") Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	
	// Классическое представление номера 74952293042.
	Если ЭтоЧисловойНомер(Параметр) Тогда
		ЧислоЦифрДляХранения = МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
		НомерТелефонаИндекс  = ПреобразоватьНомерДляСохранения(Параметр, ЧислоЦифрДляХранения);
		ИмяРегистра = "МИКО_опИндексНомераТелефонов";		
		
		Если ПараметрыКонфигурации = Неопределено Тогда
			ТекстПорядок = 1;
		ИначеЕсли ПараметрыКонфигурации.Свойство("СправочникКлиентов")
				 И ПараметрыКонфигурации.Свойство("СправочникКонтЛиц") Тогда	
			ТекстПорядок = "ВЫБОР
							|	КОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента ССЫЛКА Справочник."+ПараметрыКонфигурации.СправочникКлиентов+"
							|			ТОГДА 1
							|	КОГДА МИКО_опИндексНомераТелефонов.СсылкаНаКлиента ССЫЛКА Справочник."+ПараметрыКонфигурации.СправочникКонтЛиц+"
							|			ТОГДА 2
							|	ИНАЧЕ 3
							|	КОНЕЦ";
		Иначе
			ТекстПорядок = 1;
		КонецЕсли; 
	// Скайп номер телефона: пример miko_team.	
	ИначеЕсли ВСловеТолькоЛатиница(Параметр) Тогда
		НомерТелефонаИндекс = Параметр;
		ИмяРегистра  = "МИКО_опИндексНомераТелефоновБуквенные";	
		ТекстПорядок = 1;
	Иначе
		Возврат Неопределено;                           
	КонецЕсли;
	   
	Запрос = Новый Запрос;
	
	//Доработки для последних релизов УНФ - НАЧАЛО
	Попытка
		ИзмененаПодчиненность = МИКО_стОбщегоНазначенияСерверПовторный.ИзмененаСтруктураПодчиненностиКонтактовУНФ();
		Если ИзмененаПодчиненность Тогда
			Запрос.Текст = МИКО_стОбщегоНазначенияСерверПовторный.ПолучитьЗапросКИДляУНФ(ТекстПорядок,ИмяРегистра);
			Запрос.УстановитьПараметр("НомерТелефонаЧислом", НомерТелефонаИндекс);
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				Результат = Новый Структура("Партнер,Абонент,НомерТелефона");
				ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);
				Возврат Результат;
			КонецЕсли; 
			Возврат Неопределено;
		КонецЕсли; 
	Исключение
		ИзмененаПодчиненность = Ложь;
	КонецПопытки; 
	//Доработки для последних релизов УНФ - КОНЕЦ
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_опИндексНомераТелефонов.СсылкаНаКлиента,
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаСтрокой,"+
		ТекстПорядок + " КАК Порядок
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК МИКО_опИндексНомераТелефонов    
		|ГДЕ
		|	МИКО_опИндексНомераТелефонов.НомерТелефонаИндекс = &НомерТелефонаЧислом
		|УПОРЯДОЧИТЬ ПО 
		|  Порядок";
	Запрос.УстановитьПараметр("НомерТелефонаЧислом", НомерТелефонаИндекс);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		врДанные = Новый Структура("Владелец,ОбъектВладелец");
		ЗаполнитьЗначенияСвойств(врДанные, РезультатЗапроса.СсылкаНаКлиента);
	    Если ЗначениеЗаполнено(врДанные.Владелец) Тогда
			Результат = Новый Структура("Партнер,Абонент,НомерТелефона",врДанные.Владелец, РезультатЗапроса.СсылкаНаКлиента, РезультатЗапроса.НомерТелефонаСтрокой);
		ИначеЕсли ЗначениеЗаполнено(врДанные.ОбъектВладелец) Тогда 	
			Результат = Новый Структура("Партнер,Абонент,НомерТелефона",врДанные.ОбъектВладелец, РезультатЗапроса.СсылкаНаКлиента, РезультатЗапроса.НомерТелефонаСтрокой);
		Иначе
			Результат = Новый Структура("Партнер,Абонент,НомерТелефона",РезультатЗапроса.СсылкаНаКлиента, Неопределено, РезультатЗапроса.НомерТелефонаСтрокой);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;

КонецФункции // НайтиКлиентаПоНомеру()
 
// Десериализует представление XML контактной информации.
// Параметры 
//   ЗначенияПолей  <Строка> - XML представление контактной информации.
//   СтруктураНомера - комплексный тип: имеет свойство "Телефон" - содержит номер телефона.
// Возвращаемое значение
//   XDTO пакет.
//
Функция КонтактнаяИнформацияИзXML(Знач ЗначенияПолей, Знач Представление)
    пВерсияБиблиотекиБСП = Вычислить("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
	
	длВерсияБиблиотекиБСП = Лев(пВерсияБиблиотекиБСП,5);
	Если длВерсияБиблиотекиБСП <= "2.2.3" Тогда
		врВыражение = "КонтактнаяИнформацияСлужебный.ДесериализацияТелефона(ЗначенияПолей, Представление, Перечисления.ТипыКонтактнойИнформации.Телефон)";
	Иначе	
		РезультатыЧтения = Неопределено;
		врВыражение = "УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Телефон, РезультатыЧтения)";
	КонецЕсли; 
	РедактируемаяИнформация = Вычислить(врВыражение);	
	
	Возврат РедактируемаяИнформация;
КонецФункции // КонтактнаяИнформацияИзXML()

// Настройка использование модуля маршрутизации.
// 
Функция ИспользоватьСинтезРечи() Экспорт
	
	//Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.ИспользоватьСинтезРечиДляГолосовогоМеню, "Значение") = Истина;
	//
	//Возврат Настройка = Истина;
	
	Возврат ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.ИспользоватьСинтезРечиДляГолосовогоМеню.Значение = Истина;
	
КонецФункции // ИспользоватьСинтезРечи()

// Настройка использование модуля статистики.
// 
Функция ИспользоватьМодульСтатистики() Экспорт
	Возврат ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьМодульСтатистики()  = Истина;
КонецФункции // ИспользоватьСинтезРечи()

// Выводит сообщение пользователю методом "Сообщить"
// 
Функция ПолучитьКоличествоХранимыхЦифрТелефона() Экспорт
	                                
	Возврат МИКО_стОбщегоНазначенияСерверПовторный.КоличествоХранимыхЦифрТелефона();
	
КонецФункции

// Ищем номер телефона из второго плеча Local канала.
// 
Функция ОпределитьНомерТелефонаLocal(Знач Канал, таб_CEL, Уровень=0) Экспорт
    Уровень = Уровень + 1;
	Если Уровень>20 Тогда
     	Возврат "";
	КонецЕсли; 
	LocalКанал = ОтсечьПлечоВLocal(Канал, Ложь);	
	ИмяПлеча = ?(Найти(Канал, ";2")>0, ";1", ";2");
	КаналДляПоиска = ""+LocalКанал+ИмяПлеча;
	
	Для каждого ТекущаяСтрока Из таб_CEL Цикл
		Если ВРег(ТекущаяСтрока.appname) = "APPDIAL" Тогда
		  	Продолжить;
		КонецЕсли; 
		Если ТекущаяСтрока.channame = КаналДляПоиска Тогда
			Если Найти(ВРег(ТекущаяСтрока.peer),"LOCAL")>0 Тогда
				Канал = ТекущаяСтрока.peer;
				Возврат ОпределитьНомерТелефонаLocal(Канал, таб_CEL, Уровень);
			КонецЕсли; 
			
			Если (ВРег(ТекущаяСтрока.appname) = "DIAL" ИЛИ ВРег(ТекущаяСтрока.appname) = "APPDIAL")
				 И СтрЧислоВхождений(ТекущаяСтрока.appdata, "&")=0 Тогда
				// Исключаем звонки на группу вызовов.
				// Пример SIP/104&SIP/105.                 
				// Тут нам интересен пир, ответивший на вызов.                                   
				Peer		= ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(ТекущаяСтрока.appdata);
			Иначе
				Peer		= ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(ТекущаяСтрока.peer);
			КонецЕсли;	
			Возврат Peer;
		КонецЕсли; 
		
		Если ТекущаяСтрока.peer = КаналДляПоиска Тогда
			Если Найти(ВРег(ТекущаяСтрока.channame),"LOCAL")>0 Тогда
				Канал = ТекущаяСтрока.channame;
				Возврат ОпределитьНомерТелефонаLocal(Канал, таб_CEL, Уровень);
			КонецЕсли; 
			Возврат ТекущаяСтрока.cidnum;
		КонецЕсли; 
	КонецЦикла;                      
	
	Возврат ОпределитьНомерТелефонаLocal(Канал, таб_CEL, Уровень);
КонецФункции // ОпределитьНомерТелефонаLocal()

// Из строки вида XXXXXXXXXX@Context или Provider/XXXXXXXXXX или Provider/SIP_namber/XXXXXXXXXX, выделяет номер.
// Параметры: 
//   СтрокаНабораНомера - тип значения "строка" передается по значению, строка: содержащая номер телефона.
// Возвращаемое значение:
//   НомерТелефона - тип значения "строка".
Функция ПолучитьНомерВызываемогоАбонентаИзАтрибутаDialstring(Знач СтрокаНабораНомера) Экспорт
	Если Найти(ВРЕГ(СтрокаНабораНомера),"LOCAL")>0 Тогда
		СтрокаНабораНомера = СтрЗаменить(СтрокаНабораНомера,"/n", "");	
	КонецЕсли; 
		
	// Получим позицию начала номера.
	НачалоНомера = ПолучитьПозициюДальнегоСимвола(СтрокаНабораНомера,"/") + 1; // Если > 0 то начало номера найдено.
	// Учтем формат DIAL.
	Если СтрЧислоВхождений(СтрокаНабораНомера,"@")=1 Тогда
		СимволыПоиска = "@";
	ИначеЕсли СтрЧислоВхождений(СтрокаНабораНомера,"/")=2 Тогда	
	 	СимволыПоиска = ",";
	Иначе
		СимволыПоиска = "-,";
	КонецЕсли;
	// Получим позицию конца номера.
	ДлинаНомера  = ПолучитьПозициюБлижнегоСимвола(СтрокаНабораНомера, СимволыПоиска) - ?(НачалоНомера>0,НачалоНомера,1); // если > 0 то конец номера найден.
	// НачалоНомера - если < 0, то Сред воспринимает параметр как "НачалоСтроки"). 
	// ДлинаНомера  - Если < 0, то Сред воспринимает параметр как "ДоКонцаСтроки". 
	НомерТелефона = Сред(СтрокаНабораНомера, НачалоНомера, ?(ДлинаНомера=0,-1,ДлинаНомера));
	НомерТелефона = СтрЗаменить(НомерТелефона, "sip:","");
	Возврат НомерТелефона;
КонецФункции

// Отсекает плече в канале.
// Local/04@internal-caller-transfer-000001f0;2.
// Local/04@internal-caller-transfer-000001f0.
Функция ОтсечьПлечоВLocal(Знач Канал, Врег=Истина) Экспорт
	Канал = СтрЗаменить(Канал,"<ZOMBIE>", "");
	
	ПозицияТочки = Найти(Канал, ";");
	Если ПозицияТочки > 0 Тогда
		Канал = Лев(Канал, ПозицияТочки - 1);
	КонецЕсли; 
	
	Если Врег=Истина Тогда
	    Возврат Врег(Канал);
	Иначе		
	    Возврат Канал;
	КонецЕсли; 
КонецФункции // ОтсечьПлечоВLocal()

// Из строки вида SIP/XXXXXXXXXX-ZZZ или IAX/XXXXXXXXXX или DAHDI/XXXXXXXXXX/ZZZ, выделяет номер.
// Параметры: 
//   СтрокаНабораНомера - тип значения "строка" передается по значению, строка: содержащая номер телефона.
// Возвращаемое значение:
//   XXXXXXXXXX - тип значения "строка".
Функция ПолучитьИмяУчеткиИзКанала(Знач СтрокаНабораНомера) Экспорт
	Если Найти(ВРЕГ(СтрокаНабораНомера),"LOCAL")>0 Тогда
		СтрокаНабораНомера = СтрЗаменить(СтрокаНабораНомера,"/n", "");	
	КонецЕсли; 
	Если СтрЧислоВхождений(СтрокаНабораНомера,"/")=2 Тогда	
	 	СимволыПоиска = "/";
	Иначе
		СимволыПоиска = "-";
	КонецЕсли;
	
	// Получим позицию начала номера.
	НачалоНомера = ПолучитьПозициюБлижнегоСимвола(СтрокаНабораНомера, "/") + 1; // Если > 0 то начало номера найдено.
	// Получим позицию конца номера.
	КонецНомера = ПолучитьПозициюДальнегоСимвола(СтрокаНабораНомера, СимволыПоиска);
	Если НачалоНомера = КонецНомера Тогда
		Возврат "";
	КонецЕсли; 
	
	ДлинаНомера = КонецНомера - ?(НачалоНомера>0,НачалоНомера,1); // Если > 0 то конец номера найден.
	// НачалоНомера - если < 0, то Сред воспринимает параметр как "НачалоСтроки"). 
	// ДлинаНомера  - Если < 0, то Сред воспринимает параметр как "ДоКонцаСтроки". 
	НомерТелефона = Сред(СтрокаНабораНомера, НачалоНомера, ?(ДлинаНомера=0,-1,ДлинаНомера));
	
	Возврат НомерТелефона;
КонецФункции

// Получаем номер позиции символа в строке, первое вхождение.
// Параметры:
//   ИсхСтрока - тип значения "строка", передается по значению. Строка: в которой необходимо произвести поиск.
//   СтрокаСимволов - тип значения "строка", должна содержать набор символов: которые ищем.
// Возвращаемое значение:
//   тип значения "число" - минимальный порядковый номер символа, 0 - если ни один из символов не найден.
//
Функция ПолучитьПозициюБлижнегоСимвола(Знач ИсхСтрока, СтрокаСимволов) Экспорт
	Позиция = 0;

	Для а=1 По СтрДлина(СтрокаСимволов) Цикл
		ТекПоз = Найти(ИсхСтрока,Сред(СтрокаСимволов,а,1));
		// не учитываем нулевые позиции
		Если ТекПоз = 0 Тогда Продолжить; КонецЕсли;
		Позиция = ?( Позиция = 0,ТекПоз,МИН(Позиция, ТекПоз) );		
	КонецЦикла;
	Возврат Позиция;
КонецФункции

// Получаем номер позиции символа в строке, последнее вхождение.
// Параметры:
//   ИсхСтрока - тип значения "строка", передается по значению. Строка: в которой необходимо произвести поиск.
//   СтрокаСимволов - тип значения "строка", должна содержать набор символов: которые ищем.
// Возвращаемое значение:
//   тип значения "число" - масимальный порядковый номер символа, 0 - если ни один из символов не найден.
//
Функция ПолучитьПозициюДальнегоСимвола(Знач ИсхСтрока, СтрокаСимволов) Экспорт
	
	ДлинаСтроки = СтрДлина(ИсхСтрока);
	Для к=0 по ДлинаСтроки Цикл 
		НомерСимвола = ДлинаСтроки-к; 
		Символ = Сред(ИсхСтрока,НомерСимвола,1);
		
		Если Найти(СтрокаСимволов,Символ)>0 Тогда 
			Возврат НомерСимвола; 
		КонецЕсли; 
	КонецЦикла;	

	Возврат -1;	
КонецФункции // ПолучитьПозициюДальнегоСимвола()

// Регистрация документа "Событие" в плане обмена
// 	Источник - Объект документа
// 
Процедура ЗарегистрироватьИзмененияВПланеОбмена_стСопоставлениеСобытий(Источник) Экспорт
	
	врСопоставлениеСобытий = Вычислить("ПланыОбмена.МИКО_стСопоставлениеСобытий");
	Узел = врСопоставлениеСобытий.НайтиПоКоду("ДС");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник); 

КонецПроцедуры

// Процедура регистрирует документ звонка в плане обмена "МИКО_стСозданиеТелефонныхЗвонковCRM3"
//
Процедура ЗарегистрироватьИзмененияЗаписиЗвонкаВПланеОбмена(ДокументЗвонок) Экспорт

	врСопоставлениеСобытий = Вычислить("ПланыОбмена.МИКО_стСозданиеТелефонныхЗвонковCRM3");
	Узел = врСопоставлениеСобытий.НайтиПоКоду("ДЗ");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ДокументЗвонок);
	
КонецПроцедуры // ЗарегистрироватьИзмененияЗаписиЗвонкаВПланеОбмена()

///
// Коды городов

// Функция рабивает номер телефона на составляющие.
// Параметры: 
//   НомерТелефона - передается по значению, тип "строка", номер телефона.
// Возвращаемое значение:
//   Неопределено - если разложить номер не получилось.
//   тип Структура("КодСтраны,КодГорода,Страна,Область,Город,НомерБезПрефиксов,Номер").
Функция РазложитьНомерТелефона(Знач НомерТелефона) Экспорт
	СтруктураНомера = Новый Структура("КодСтраны,КодГорода,Страна,Область,Город,НомерБезПрефиксов,Номер,ТипНомера,UTC");	
	
	Если НЕ ЭтоЧисловойНомер(НомерТелефона) Тогда
		Если ВСловеТолькоЛатиница(НомерТелефона) Тогда
		 	СтруктураНомера.Вставить("ТипНомера","Skype");
			СтруктураНомера.Вставить("Номер", НомерТелефона);
			СтруктураНомера.Вставить("НомерБезПрефиксов",НомерТелефона);
			Возврат СтруктураНомера;	
		Иначе	
			// кирилица в номере / недопустимые символы
			Возврат Неопределено;	
		КонецЕсли; 
	КонецЕсли; 
	НомерТелефона = УбратьИзСтрокиТелефонаВсеБуквы(НомерТелефона);
	Если Лев(НомерТелефона, 1) = "8" Тогда
		НомерТелефона = "7"+Прав(НомерТелефона,СтрДлина(НомерТелефона) - 1);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Если Лев(НомерТелефона, 2) = "38" Тогда
		// Украина
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	МИКО_опКодыГородов.ШаблонПоиска,
		        |	МИКО_опКодыГородов.КодСтраны,
		        |	МИКО_опКодыГородов.КодГорода,
		        |	МИКО_опКодыГородов.Город,
		        |	МИКО_опКодыГородов.Область,
		        |	МИКО_опКодыГородов.Страна,
		        |	МИКО_опКодыГородов.НачалоДиапазона,
		        |	МИКО_опКодыГородов.КонецДиапазона,
		        |	МИКО_опКодыГородов.Приоритетный КАК Приоритетный,
		        |	МИКО_опКодыГородов.UTC
		        |ПОМЕСТИТЬ ВТ
		        |ИЗ
		        |	РегистрСведений.МИКО_опКодыГородов КАК МИКО_опКодыГородов
		        |ГДЕ
		        |	МИКО_опКодыГородов.Индекс = 1380
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ.ШаблонПоиска,
		        |	ВТ.КодСтраны,
		        |	ВТ.КодГорода,
		        |	ВТ.Город,
		        |	ВТ.Область,
		        |	ВТ.Страна,
		        |	ВТ.НачалоДиапазона,
		        |	ВТ.КонецДиапазона,
		        |	ВТ.Приоритетный
		        |ИЗ
		        |	ВТ КАК ВТ
		        |ГДЕ
		        |	&НомерТелефона ПОДОБНО ВТ.ШаблонПоиска
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ВТ.Приоритетный УБЫВ";
		Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	ИначеЕсли Лев(НомерТелефона, 1) = "7" Тогда	
		Индекс 		= Число(Лев(Формат(ПреобразоватьНомерДляСохранения(НомерТелефона, 32),"ЧГ="),9));
		НомерЧислом = Число(Формат(ПреобразоватьНомерДляСохранения(НомерТелефона, 32),"ЧГ="));
		// Россия
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		        |	МИКО_опКодыГородов.Индекс,
		        |	МИКО_опКодыГородов.НачалоДиапазона,
		        |	МИКО_опКодыГородов.КонецДиапазона,
		        |	МИКО_опКодыГородов.ШаблонПоиска,
		        |	МИКО_опКодыГородов.КодСтраны,
		        |	МИКО_опКодыГородов.Город,
		        |	МИКО_опКодыГородов.Область,
		        |	МИКО_опКодыГородов.Страна,
		        |	МИКО_опКодыГородов.Приоритетный,
		        |	МИКО_опКодыГородов.КодГорода,
		        |	МИКО_опКодыГородов.UTC
		        |ПОМЕСТИТЬ ПользовательскиеКоды
		        |ИЗ
		        |	РегистрСведений.МИКО_опКодыГородов КАК МИКО_опКодыГородов
		        |ГДЕ
		        |	МИКО_опКодыГородов.Приоритетный = &Приоритетный
		        |	И МИКО_опКодыГородов.НачалоДиапазона <= &НомерЧислом
		        |	И МИКО_опКодыГородов.КонецДиапазона >= &НомерЧислом
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ПользовательскиеКоды.Индекс,
		        |	ПользовательскиеКоды.НачалоДиапазона,
		        |	ПользовательскиеКоды.КонецДиапазона,
		        |	ПользовательскиеКоды.ШаблонПоиска,
		        |	ПользовательскиеКоды.КодСтраны,
		        |	ПользовательскиеКоды.Город,
		        |	ПользовательскиеКоды.Область,
		        |	ПользовательскиеКоды.Страна,
		        |	ПользовательскиеКоды.Приоритетный,
		        |	ПользовательскиеКоды.КодГорода,
		        |	ПользовательскиеКоды.UTC
		        |ПОМЕСТИТЬ НайденныеПользовательскиеРегионы
		        |ИЗ
		        |	ПользовательскиеКоды КАК ПользовательскиеКоды
		        |ГДЕ
		        |	ПользовательскиеКоды.НачалоДиапазона <= &НомерЧислом
		        |	И ПользовательскиеКоды.КонецДиапазона >= &НомерЧислом
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ ПЕРВЫЕ 5
		        |	МИКО_опКодыГородов.КодГорода,
		        |	МИКО_опКодыГородов.КодСтраны,
		        |	МИКО_опКодыГородов.Город,
		        |	МИКО_опКодыГородов.Область,
		        |	МИКО_опКодыГородов.Страна,
		        |	МИКО_опКодыГородов.UTC,
		        |	МИКО_опКодыГородов.Приоритетный КАК Приоритетный
		        |ИЗ
		        |	РегистрСведений.МИКО_опКодыГородов КАК МИКО_опКодыГородов
		        |ГДЕ
		        |	МИКО_опКодыГородов.Индекс = &Индекс
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	НайленныеПользовательскиеРегионы.КодГорода,
		        |	НайленныеПользовательскиеРегионы.КодСтраны,
		        |	НайленныеПользовательскиеРегионы.Город,
		        |	НайленныеПользовательскиеРегионы.Область,
		        |	НайленныеПользовательскиеРегионы.Страна,
		        |	НайленныеПользовательскиеРегионы.UTC,
		        |	НайленныеПользовательскиеРегионы.Приоритетный
		        |ИЗ
		        |	НайденныеПользовательскиеРегионы КАК НайленныеПользовательскиеРегионы
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Приоритетный УБЫВ";
		Запрос.УстановитьПараметр("Индекс", 	  Индекс);			
		Запрос.УстановитьПараметр("НомерЧислом",  НомерЧислом);			
		Запрос.УстановитьПараметр("Приоритетный", 100);			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Запрос.Текст = Текст;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураНомера, Выборка);
	
	Номер = Прав(НомерТелефона, СтрДлина(НомерТелефона) - СтрДлина(""+Выборка.КодСтраны + Выборка.КодГорода));
	СтруктураНомера.Вставить("Номер", Номер);
	СтруктураНомера.Вставить("НомерБезПрефиксов",""+Выборка.КодСтраны + Выборка.КодГорода + Номер);
	СтруктураНомера.Вставить("ТипНомера","Телефон");
	
	Возврат СтруктураНомера;
КонецФункции // РазложитьНомерТелефона()

// Заполнение регистра сведений "МИКО_опКодыГородов", кодов городов для разбора номера.
//
Процедура ЗагрузитьКодыГородов(НомерПопытки=0, КодыУкраиныЗаписаны=Истина, TimeZones=Неопределено) Экспорт
	
	Если TimeZones=Неопределено Тогда
		МакетКоды 	= ПолучитьОбщийМакет("МИКО_опКодыГородов");     
		врTimeZones = МакетКоды.ПолучитьОбласть("TimeZones");                 
		TimeZones = Новый Соответствие;
		Для KК = 1 По врTimeZones.ВысотаТаблицы Цикл
			Регион	= СокрЛП(врTimeZones.Область(KК, 1).Текст);
			UTC		= Число(СокрЛП(врTimeZones.Область(KК, 2).Текст));
			TimeZones.Вставить(Регион, UTC);
		КонецЦикла;
	КонецЕсли; 
	Если КодыУкраиныЗаписаны=Ложь Тогда
		Если МакетКоды = Неопределено Тогда
			МакетКоды = ПолучитьОбщийМакет("МИКО_опКодыГородов");     
		КонецЕсли; 
		// Коды городов Украины.
		ОбластьКодыГородов  = МакетКоды.ПолучитьОбласть("Коды_380");
		Для КК = 1 По ОбластьКодыГородов.ВысотаТаблицы Цикл
			СтрТЧ = РегистрыСведений.МИКО_опКодыГородов.СоздатьМенеджерЗаписи();
			
			СтрТЧ.Индекс	= 1380;
			СтрТЧ.Город		= ОбластьКодыГородов.Область(КК, 1).Текст;
			СтрТЧ.Область	= ОбластьКодыГородов.Область(КК, 2).Текст;
			СтрТЧ.Страна	= "Украина";
			СтрТЧ.КодСтраны	= "380";
			СтрТЧ.КодГорода	= ОбластьКодыГородов.Область(КК, 3).Текст;
			СтрТЧ.ШаблонПоиска	= СтрТЧ.КодСтраны + СтрТЧ.КодГорода + "%"; 
			Если СтрТЧ.ШаблонПоиска = "%" Тогда
			  	Продолжить;
			КонецЕсли;
			СтрТЧ.UTC 		   = 3;
			СтрТЧ.Приоритетный = 38;
			СтрТЧ.Записать();	
		КонецЦикла;
		КодыУкраиныЗаписаны = Истина;
	КонецЕсли; 
	
	КодыГородов   = ПолучитьОбщийМакет("МИКО_опКодыГородовРоссии").ПолучитьОбласть("КодыНомеров");
	// Попробуем ограничить число записей в регистр сведений.
	ПозицияЗагрузкиКодовГородов = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов();
	
	НачатьТранзакцию();
	ЧислоСтрокВТранзакции = 0;
	
	КэшИндексов = Новый Соответствие;
	// Тут используются диапазоны 
	// попробуем их преобразовать в шаблоны поиска.
	KК = ПозицияЗагрузкиКодовГородов;
	МаксОпераций = 50000;
	Пока KК < КодыГородов.ВысотаТаблицы Цикл
		
		KК = KК + 1;
		МаксОпераций = МаксОпераций - 1;
		КодГорода 	= СокрЛП(КодыГородов.Область(KК, 1).Текст);
		
		врДанные = Новый Структура;
		врДанные.Вставить("Страна", 	 "РФ");
		врДанные.Вставить("КодСтраны",   "7");
		врДанные.Вставить("Область", 	 СокрЛП(КодыГородов.Область(KК, 6).Текст));
		врДанные.Вставить("ШаблонПоиска","7");
		врДанные.Вставить("КодГорода", 	 КодГорода);
		врДанные.Вставить("Приоритетный",7);
		
		Для каждого текZone Из TimeZones Цикл
		 	Если Найти(врДанные.Область, текZone.Ключ)>0 Тогда
				врДанные.Вставить("UTC", текZone.Значение);
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		сч = ПреобразоватьНомерДляСохранения("7"+КодГорода + ДополнитьЛидирующиеНули(КодыГородов, KК, 2), 32);
		КонецДиапазона  = ПреобразоватьНомерДляСохранения("7"+КодГорода + ДополнитьЛидирующиеНули(КодыГородов, KК, 3), 32);
		
		Емкость = Число(СокрЛП(КодыГородов.Область(KК, 4).Текст));
		текИндекс = ""; ШагИндекса = 1000;
		Пока сч <= КонецДиапазона Цикл
			Индекс		 = Число(Лев(Формат(сч,"ЧГ="),9));
			
			// Приоритет за большей емкостью.
			врЕмкостьКэш = КэшИндексов.Получить(Индекс);
			Если врЕмкостьКэш <> Неопределено
				 И врЕмкостьКэш > Емкость Тогда
				сч = сч + ШагИндекса; 
				Продолжить;	
			КонецЕсли; 
			
			Если Индекс <> текИндекс Тогда
				СтрТЧ = РегистрыСведений.МИКО_опКодыГородов.СоздатьМенеджерЗаписи();
				СтрТЧ.Индекс = Индекс;
				ЗаполнитьЗначенияСвойств(СтрТЧ, врДанные);
				Попытка
					СтрТЧ.Записать();
					ЧислоСтрокВТранзакции = ЧислоСтрокВТранзакции + 1;
				Исключение
					Продолжить;
				КонецПопытки; 
				КэшИндексов.Вставить(Индекс, Емкость);
				текИндекс = Индекс;
				
				Если ЧислоСтрокВТранзакции > 3000 Тогда
					ЗафиксироватьТранзакцию();
					ЧислоСтрокВТранзакции = 1;
					НачатьТранзакцию();
				КонецЕсли; 
			КонецЕсли; 
			сч = сч + ШагИндекса;
		КонецЦикла;	
		
		Если МаксОпераций < 0 Тогда
		 	Прервать;		
		КонецЕсли; 
	КонецЦикла;
	Если ЧислоСтрокВТранзакции > 0 Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
	KК = ?(KК >= КодыГородов.ВысотаТаблицы,0,KК);
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов(KК);
	
КонецПроцедуры

// В зависимости от длинны строки добавляет необходимо число лидирующих нулей.
// 
Функция ДополнитьЛидирующиеНули(КодыГородов, КK, NN)
   	Значение = СокрЛП(КодыГородов.Область(КK, NN).Текст);
	
	длСтроки = СтрДлина(Значение);
	Если длСтроки = 7 Тогда
	ИначеЕсли длСтроки = 6 Тогда	
		Значение = "0"+Значение;	
	ИначеЕсли длСтроки = 5 Тогда	
		Значение = "00"+Значение;		
	ИначеЕсли длСтроки = 4 Тогда	
		Значение = "000"+Значение;			
	ИначеЕсли длСтроки = 3 Тогда	
		Значение = "0000"+Значение;				
	ИначеЕсли длСтроки = 2 Тогда	
		Значение = "00000"+Значение;					
	ИначеЕсли длСтроки = 1 Тогда	
		Значение = "000000"+Значение;
	ИначеЕсли длСтроки = 0 ИЛИ длСтроки>7 Тогда
		Значение = "0000000"+Значение;
	КонецЕсли; 	
	Возврат Значение;
КонецФункции // ДополнитьЛидирующиеНули()

///
// Функции работы со строками.
/// 

// Оставляет в номере телефона только цифры, все остальные символы удаляются.
//
Функция УбратьИзСтрокиТелефонаВсеБуквы(Знач НомерТелефона) Экспорт
	ТолькоЦифрыНомера = "";
	Для а=1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
КонецФункции

// Функцией производится попытка преобразовать строку в дату.
// 
Функция ПреобразоватьВДату(Знач парамДата) Экспорт
	Если ТипЗнч(парамДата) = Тип("Дата") Тогда
		Возврат парамДата;
	КонецЕсли; 
	НачалоВремен 	= Дата("19700101");
	ПустаяДата 		= Дата("00010101");
	
	Если Найти(""+парамДата, ".")>0 И Найти(""+парамДата, "-")>0 Тогда
		// Это обычная дата с точностью до милисекунд.
		парамДата = Лев(парамДата, Найти(""+парамДата, ".")-1);	
	КонецЕсли;
	
	Если Найти(""+парамДата, ".")>0 Тогда
		// Формат даты UNIX
		Если ТипЗнч(парамДата) = Тип("Строка") Тогда
			Попытка
			  	парамДата = Число(парамДата);
			Исключение
				Возврат ПустаяДата;
			КонецПопытки; 
		ИначеЕсли ТипЗнч(парамДата) = Тип("Число") Тогда
			// тут все ок	
		Иначе
			Возврат ПустаяДата;
		КонецЕсли; 
		Если (ПустаяДата + парамДата) < НачалоВремен Тогда
			парамДата = НачалоВремен + парамДата;	
		КонецЕсли;
	Иначе	
		Если НЕ ЗначениеЗаполнено(парамДата) Тогда
			Возврат ПустаяДата;
		КонецЕсли; 
		Попытка
			парамДата = Дата(МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(парамДата));
		Исключение
			Возврат ПустаяДата;
		КонецПопытки; 	
	КонецЕсли; 
	
	Возврат парамДата;
КонецФункции // ПреобразоватьВДату()


// Функция сначала убирает из номера телефона все не относящееся к цифрам, а
// затем обрезает значащее количество цифр справа телефонного номера,
// количество этих цифр задается в константе КоличествоХранимыхЦифрТелефона
// возвращает число.
Функция ПреобразоватьНомерДляСохранения(Знач НомерТелефона, ЧислоСимволов = 9) Экспорт
	Префикс = "1";
	НомерТелефона = УбратьИзСтрокиТелефонаВсеБуквы(НомерТелефона);
	Возврат ?(НЕ ЗначениеЗаполнено(НомерТелефона), 0, Число(Префикс + Прав(СокрЛП(НомерТелефона), ЧислоСимволов)));
КонецФункции

// Функция убирает из номера телефона все префиксы, например, 999-99*99, будет 9999999. 
// 
Функция УбратьИзНомераТелефонаВсеПрефиксы(Знач НомерТелефона, Знач СтрокаПрефиксов=" /*-+=_.\,!;%:?()") Экспорт
	Для НомерПрефикс = 1 По СтрДлина(СтрокаПрефиксов) Цикл
		ТекущийПрефикс = Сред(СтрокаПрефиксов, НомерПрефикс, 1);
		НомерТелефона = СтрЗаменить(НомерТелефона, ТекущийПрефикс, "");
	КонецЦикла;
	Возврат НомерТелефона;
КонецФункции
 
// Проверка номера телефона на наличие букв.
// Параметры:
//   НомерТелефона - тип строка, номер телефона для анализа.
// Возвращаемое значение:
//   булево.
Функция ЭтоЧисловойНомер(Знач НомерТелефона) Экспорт
	НомерБезПрефиксов = УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
	НомерБезБукв 	  = УбратьИзСтрокиТелефонаВсеБуквы(НомерБезПрефиксов);
	Возврат (СтрДлина(НомерБезПрефиксов)=СтрДлина(НомерБезБукв));			
КонецФункции // ЭтоНеЧисловойНомер()

// Проверка на латинские символы
// 
Функция ВСловеТолькоЛатиница(знач Слово) Экспорт
	НовоеСлово= "";
	спТранслит = Новый ("Соответствие");
	
	спТранслит.Вставить("i","i"); 
	спТранслит.Вставить("q","q");
	спТранслит.Вставить("w","w");
	спТранслит.Вставить("e","e");
	спТранслит.Вставить("r","r");
	спТранслит.Вставить("t","t");
	спТранслит.Вставить("y","y");
	спТранслит.Вставить("u","u");
	спТранслит.Вставить("i","i");
	спТранслит.Вставить("o","o");
	спТранслит.Вставить("p","p");
	спТранслит.Вставить("a","a");
	спТранслит.Вставить("s","s");
	спТранслит.Вставить("d","d");
	спТранслит.Вставить("f","f");
	спТранслит.Вставить("g","g");
	спТранслит.Вставить("h","h");
	спТранслит.Вставить("j","j");
	спТранслит.Вставить("k","k");
	спТранслит.Вставить("l","l");
	спТранслит.Вставить("z","z");
	спТранслит.Вставить("x","x");
	спТранслит.Вставить("c","c");
	спТранслит.Вставить("v","v");
	спТранслит.Вставить("b","b");
	спТранслит.Вставить("n","n");
	спТранслит.Вставить("m","m");
	
	спТранслит.Вставить("-","-");
	спТранслит.Вставить("_","_");
	спТранслит.Вставить(".",".");
	
	спТранслит.Вставить("!","!"); 
	спТранслит.Вставить("?","?"); 
	
	спТранслит.Вставить("$","$"); 
	спТранслит.Вставить("%","%"); 
	спТранслит.Вставить("@","@"); 
	спТранслит.Вставить("&","&"); 
	спТранслит.Вставить("=","="); 
	спТранслит.Вставить("+","+"); 
	
	спТранслит.Вставить("(","(");
	спТранслит.Вставить(")",")");  
	спТранслит.Вставить("[","["); 
	спТранслит.Вставить("]","]");  
	спТранслит.Вставить("}","}"); 
	спТранслит.Вставить("{","{");
	спТранслит.Вставить("0","0");
	спТранслит.Вставить("1","1");
	спТранслит.Вставить("2","2");
	спТранслит.Вставить("3","3");
	спТранслит.Вставить("4","4");
	спТранслит.Вставить("5","5");
	спТранслит.Вставить("6","6");
	спТранслит.Вставить("7","7");
	спТранслит.Вставить("8","8");  
	спТранслит.Вставить("9","9");
	
	Для а=1 по СтрДлина(Слово) Цикл
		Если спТранслит.Получить(НРЕГ(Сред(Слово,а,1))) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;
КонецФункции

// #КонецОбласти
